logs/vultr-25gbssd-ubuntu/web_wp_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking x.x.x.x (be patient)


Server Software:        Apache
Server Hostname:        x.x.x.x
Server Port:            80

Document Path:          /wordpress/2017/05/01/hello-world
Document Length:        0 bytes

Concurrency Level:      50
Time taken for tests:   180.002 seconds
Complete requests:      16578
Failed requests:        0
Non-2xx responses:      16578
Total transferred:      5852034 bytes
HTML transferred:       0 bytes
Requests per second:    92.10 [#/sec] (mean)
Time per request:       542.895 [ms] (mean)
Time per request:       10.858 [ms] (mean, across all concurrent requests)
Transfer rate:          31.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       34   48  86.7     43    3127
Processing:    55  494  97.9    484    2165
Waiting:       55  492  97.6    483    2165
Total:         99  542 131.3    526    3592

Percentage of the requests served within a certain time (ms)
  50%    526
  66%    550
  75%    566
  80%    576
  90%    612
  95%    657
  98%    819
  99%   1301
 100%   3592 (longest request)