logs/vultr-25gbssd-ubuntu/web_wp_ab_10.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking x.x.x.x (be patient)


Server Software:        Apache
Server Hostname:        x.x.x.x
Server Port:            80

Document Path:          /wordpress/2017/05/09/hello-world/
Document Length:        56192 bytes

Concurrency Level:      10
Time taken for tests:   180.014 seconds
Complete requests:      4180
Failed requests:        0
Total transferred:      236847108 bytes
HTML transferred:       235159344 bytes
Requests per second:    23.22 [#/sec] (mean)
Time per request:       430.655 [ms] (mean)
Time per request:       43.065 [ms] (mean, across all concurrent requests)
Transfer rate:          1284.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       35   86 202.3     48    3126
Processing:   141  344 185.0    308    2864
Waiting:       53  139 154.7    116    2508
Total:        178  430 306.8    362    4667

Percentage of the requests served within a certain time (ms)
  50%    362
  66%    404
  75%    440
  80%    468
  90%    606
  95%    725
  98%   1367
  99%   1615
 100%   4667 (longest request)