logs/vultr-25gbssd-ubuntu/web_wp_wrk_100.log
Running 3m test @ http://x.x.x.x/wordpress/2017/05/09/hello-world/
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.56s   373.01ms   2.00s    77.06%
    Req/Sec     5.37      4.77    40.00     92.05%
  Latency Distribution
     50%    1.70s 
     75%    1.82s 
     90%    1.90s 
     99%    1.99s 
  5644 requests in 3.00m, 306.69MB read
  Socket errors: connect 0, read 379, write 0, timeout 4297
Requests/sec:     31.34
Transfer/sec:      1.70MB