logs/vultr-25gbssd-ubuntu/web_wp_wrk_200.log
Running 3m test @ http://x.x.x.x/wordpress/2017/05/01/hello-world
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   195.31ms  225.97ms   2.00s    87.48%
    Req/Sec    51.00     29.21   210.00     67.67%
  Latency Distribution
     50%   97.71ms
     75%  244.51ms
     90%  479.82ms
     99%    1.10s 
  82194 requests in 3.00m, 45.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 1088
  Non-2xx or 3xx responses: 80670
Requests/sec:    456.48
Transfer/sec:    258.26KB